app/Controllers/Home.php

SELECT *
FROM `destinations`
SELECT *
FROM `tour_packages`
---
    public function index()
    {
        $destinationModel = new DestinationModel();
        $tourGuideModel = new TourGuideModel();
        $tourPackageModel = new TourPackageModel();
        $sliderModel = new \App\Models\SliderModel();
        $galleryModel = new \App\Models\GalleryModel();
        $guideModel = new \App\Models\LocalGuideModel();
        $data = [

             'gallery' => $galleryModel->getGalleryImages(8),
            'sliders' => $sliderModel->getActiveSliders(),
            'destinations' => $destinationModel->findAll(),
            'guides' => $guideModel->getVerifiedGuides(),
            'packages' => $tourPackageModel->findAll(),