app/Models/GalleryModel.php

    public function getGalleryImages($limit = 8)
    {
        return $this->orderBy('display_order', 'ASC')
                   ->orderBy('created_at', 'DESC')
                   ->limit($limit)
                   ->findAll();
---
SELECT *
FROM `galleries`
ORDER BY `display_order` ASC, `created_at` DESC
 LIMIT 8