app/Models/LocalGuideModel.php

    public function getVerifiedGuides($limit = 5)
    {
        return $this->where('is_verified', true)
                   ->orderBy('rating', 'DESC')
                   ->orderBy('years_experience', 'DESC')
                   ->limit($limit)
                   ->findAll();
---
SELECT *
FROM `local_guides`
WHERE `is_verified` = 1
ORDER BY `rating` DESC, `years_experience` DESC
 LIMIT 5