app/Models/SliderModel.php

    public function getActiveSliders()
    {
        return $this->where('is_active', true)
                   ->orderBy('display_order', 'ASC')
                   ->findAll();
---
SELECT *
FROM `sliders`
WHERE `is_active` = 1
ORDER BY `display_order` ASC